Repository: junyu17/Maren
Catalog: Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, zh_hant

source: 除了经期和情绪,你可以留意:体重变化、痤疮、多毛、脱发、疲惫、食欲与情绪波动。在「今天」页记录体重,并用症状标签或「自定义追踪项」记下这些,时间久了能看到自己的规律。
en: Beyond periods and mood, you can watch for: weight changes, acne, excess hair, hair loss, fatigue, and shifts in appetite and mood. Log your weight on the Today tab and note these with symptom tags or custom trackers — over time your patterns become clearer.
es: Además del periodo y el ánimo, puedes vigilar: cambios de peso, acné, exceso de vello, caída del cabello, fatiga y cambios en el apetito y el ánimo. Registra tu peso en la pestaña Hoy y anota estas cosas con etiquetas de síntoma o seguimientos personalizados: con el tiempo tus patrones se verán más claros.
ja: 生理や気分以外にも、体重の変化、ニキビ、多毛、抜け毛、疲労、食欲や気分の変動にも注目してみましょう。「今日」ページで体重を記録し、症状タグや「カスタムトラッカー」でこれらを記録しておくと、時間が経つにつれて自分のパターンが見えてきます。
ko: 생리와 기분 외에도 체중 변화, 여드름, 다모, 탈모, 피로, 식욕과 기분의 변화를 살펴볼 수 있어요. 오늘 탭에서 체중을 기록하고, 증상 태그나 사용자 추적 항목으로 이런 변화를 메모해 보세요. 시간이 지나면 나의 패턴이 더 또렷해져요.
zh_hant: 除了經期和情緒,你可以留意:體重變化、痤瘡、多毛、脫髮、疲憊、食慾與情緒波動。在「今天」頁記錄體重,並用症狀標籤或「自定義追蹤項」記下這些,時間久了能看到自己的規律。

source: 隐私
en: Privacy
es: Privacidad
ja: プライバシー
ko: 개인정보
zh_hant: 隱私

source: 隐私政策
en: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hant: 隱私政策

source: 需要至少 4 个完整周期(当前 + 3 个历史)才能进行对比分析。继续记录,这里会自动生成你的周期变化报告。
en: At least 4 complete cycles (current + 3 historical) needed for comparison. Keep recording — your cycle change report will appear here automatically.
es: Hacen falta al menos 4 ciclos completos (el actual + 3 anteriores) para comparar. Sigue registrando y tu informe de cambios del ciclo aparecerá aquí automáticamente.
ja: 比較には少なくとも4周期分(今回の周期+過去3周期)の記録が必要です。記録を続けると、ここに周期変化レポートが自動的に表示されます。
ko: 비교하려면 완전한 주기가 최소 4회(현재 + 이전 3회) 필요해요. 계속 기록하면 주기 변화 리포트가 여기에 자동으로 나타나요.
zh_hant: 需要至少 4 個完整週期(當前 + 3 個歷史)才能進行對比分析。繼續記錄,這裡會自動生成你的週期變化報告。

source: 需要至少 4 个完整周期(最近完成 + 3 个历史)才能进行对比分析。继续记录,这里会自动生成你的周期变化报告。
en: Need at least 4 complete cycles (latest completed + 3 historical) to compare. Keep logging — your cycle change report will appear here.
es: Hacen falta al menos 4 ciclos completos (el último completado + 3 anteriores) para comparar. Sigue registrando y aquí aparecerá tu informe de cambios del ciclo.
ja: 比較には少なくとも4周期分(直近の完了周期+過去3周期)の記録が必要です。記録を続けると、ここに周期変化レポートが自動的に表示されます。
ko: 비교하려면 완전한 주기가 최소 4회(가장 최근 완료 + 이전 3회) 필요해요. 계속 기록하면 주기 변화 리포트가 여기에 나타나요.
zh_hant: 需要至少 4 個完整週期(最近完成 + 3 個歷史)才能進行對比分析。繼續記錄,這裡會自動生成你的週期變化報告。

source: 需要重启 Maren
en: Restart Maren
es: Reiniciar Maren
ja: Marenを再起動
ko: Maren 다시 시작
zh_hant: 需要重啟 Maren

source: 青
en: Teal
es: Turquesa
ja: ティール
ko: 청록

source: 预测你的经期约在 %lld 天后,可以提前做点准备。
en: Your period may be about %lld days away — maybe prep a little.
es: Puede que a tu periodo le falten unos %lld días; quizá te venga bien prepararte un poco.
ja: 生理まであと約%lld日かもしれません。少し準備しておきましょう。
ko: 생리가 약 %lld일 뒤일 수 있어요. 미리 조금 준비해 두세요.
zh_hant: 預測你的經期約在 %lld 天后,可以提前做點準備。

source: 预测你的经期约在 2 天后,可以提前做点准备。
en: Your period is predicted in about 2 days — a little prep may help.
es: Se prevé tu periodo en unos 2 días; quizá te venga bien prepararte un poco.
ja: 生理まであと約2日と予測されています。少し準備しておくといいかもしれません。
ko: 생리가 약 2일 뒤로 예상돼요. 미리 조금 준비해 두면 좋아요.
zh_hant: 預測你的經期約在 2 天后,可以提前做點準備。

source: 预测你的经期约在两天后,可以提前做点准备。
en: Your period is predicted in about two days — a little prep may help.
es: Se prevé tu periodo en unos dos días; quizá te venga bien prepararte un poco.
ja: 生理まであと約2日と予測されています。少し準備しておくといいかもしれません。
ko: 생리가 약 이틀 뒤로 예상돼요. 미리 조금 준비해 두면 좋아요.
zh_hant: 預測你的經期約在兩天後,可以提前做點準備。

source: 预测只学习你自己的真实周期,不套用「第 14 天」模板;还会在本机发现属于你的规律。不吹精准,如实呈现区间。
en: Predictions learn only from your own cycles — no “day 14” template — and surface your patterns on-device. No false precision; ranges shown honestly.
es: Las predicciones aprenden solo de tus propios ciclos, sin la plantilla del «día 14», y muestran tus patrones en el dispositivo. Sin falsa precisión: los rangos se muestran con honestidad.
ja: 予測はあなた自身の周期だけから学習し、「14日目」のような固定テンプレートは使いません。端末内であなたのパターンを見つけ出します。誤った精密さを装わず、実際の幅をそのまま示します。
ko: 예측은 '14일째' 같은 공식 없이 내 주기만 보고 학습하며, 기기 안에서 나만의 패턴을 보여 드려요. 정확한 척하지 않고 범위를 솔직하게 보여 드려요.
zh_hant: 預測只學習你自己的真實週期,不套用「第 14 天」模板;還會在本機發現屬於你的規律。不吹精準,如實呈現區間。

source: 预测将按你填的周期推算,只要记录过 1 次经期就能用。关掉后回到自动学习你的真实记录。
en: Predictions will use the cycle you entered — it works after just one logged period. Turn it off to go back to learning from your actual records.
es: Las predicciones usarán el ciclo que has introducido; funciona con un solo periodo registrado. Desactívalo para volver a aprender de tus registros reales.
ja: 予測は入力した周期を使用します。生理を1回記録するだけで利用できます。オフにすると、あなたの実際の記録から学習する方式に戻ります。
ko: 예측에 내가 입력한 주기를 사용해요. 생리를 한 번만 기록해도 바로 쓸 수 있어요. 끄면 다시 실제 기록으로 학습해요.
zh_hant: 預測將按你填的週期推算,只要記錄過 1 次經期就能用。關掉後回到自動學習你的真實記錄。

source: 预测经期
en: Predicted period
es: Periodo previsto
ja: 予測された生理
ko: 예상 생리
zh_hant: 預測經期

source: 预计区间:%@
en: Expected range: %@
es: Rango previsto: %@
ja: 予測範囲:%@
ko: 예상 범위: %@
zh_hant: 預計區間:%@

source: 预计开始区间
en: Predicted start window
es: Ventana de inicio prevista
ja: 予測される開始時期
ko: 예상 시작 시기
zh_hant: 預計開始區間

source: 预计经期就在今天前后
en: Your period is expected around today
es: Se espera tu periodo hacia hoy
ja: 生理は今日前後に予測されています
ko: 오늘쯤 생리가 시작될 것으로 예상돼요
zh_hant: 預計經期就在今天前後

source: 颈部疼痛
en: Neck pain
es: Dolor de cuello
ja: 首の痛み
ko: 목 통증
zh_hant: 頸部疼痛

source: 食欲下降
en: Decreased appetite
es: Menos apetito
ja: 食欲の低下
ko: 식욕 감소
zh_hant: 食慾下降

source: 食欲变化
en: Cravings
es: Antojos
ja: 食べ物への渇望
ko: 음식 당김
zh_hant: 食慾變化

source: 食欲增加
en: Increased appetite
es: Más apetito
ja: 食欲の増加
ko: 식욕 증가
zh_hant: 食慾增加

source: 髋部疼痛
en: Hip pain
es: Dolor de cadera
ja: 股関節の痛み
ko: 엉덩이 통증
zh_hant: 髖部疼痛

source: 高级排程
en: Advanced schedule
es: Programación avanzada
ja: 詳細スケジュール
ko: 고급 일정
zh_hant: 高階排程

source: 高级排程(多时段 / 按周几)
en: Advanced schedule (multi-time / by weekday)
es: Programación avanzada (varias horas / por día de la semana)
ja: 詳細スケジュール(複数時間帯 / 曜日別)
ko: 고급 일정(여러 시간대 / 요일별)
zh_hant: 高階排程(多時段 / 按周幾)

source: 高级提醒
en: Advanced reminders
es: Recordatorios avanzados
ja: 高度なリマインダー
ko: 고급 알림
zh_hant: 高階提醒

source: 高级提醒(Pro)
en: Advanced reminders (Pro)
es: Recordatorios avanzados (Pro)
ja: 高度なリマインダー(Pro)
ko: 고급 알림(Pro)
zh_hant: 高階提醒(Pro)

source: 高级趋势
en: Advanced trends
es: Tendencias avanzadas
ja: 高度なトレンド
ko: 고급 추이
zh_hant: 高階趨勢

source: 高频追踪项
en: High-frequency tracker
es: Seguimiento de alta frecuencia
ja: よく記録されるトラッカー
ko: 자주 기록한 추적 항목
zh_hant: 高頻追蹤項

source: 高频追踪项:
en: Top trackers:
es: Seguimientos principales:
ja: よく記録されるトラッカー:
ko: 상위 추적 항목:
zh_hant: 高頻追蹤項:

source: 麻木刺痛
en: Tingling
es: Hormigueo
ja: しびれ
ko: 저림

source: 黄体期
en: Luteal
es: Lútea
ko: 황체기
zh_hant: 黃體期

source: 黄体期情绪和身体容易起伏,对自己温柔一点。
en: Mood and body can fluctuate during the luteal phase — be gentle with yourself.
es: El ánimo y el cuerpo pueden fluctuar en la fase lútea: trátate con cariño.
ja: 黄体期は気分や体調が揺れやすい時期です。自分に優しくしてください。
ko: 황체기에는 기분과 몸이 오르내릴 수 있어요. 스스로에게 다정하게 대해 주세요.
zh_hant: 黃體期情緒和身體容易起伏,對自己溫柔一點。

source: 默认玫瑰色。升级 Premium 解锁全部 5 套配色。
en: Default rose. Upgrade to Premium to unlock all 5 themes.
es: Rosa por defecto. Mejora a Premium para desbloquear los 5 temas.
ja: デフォルトはローズです。Premiumにアップグレードすると、5種類すべてのテーマをロック解除できます。
ko: 기본은 로즈예요. Premium으로 업그레이드하면 테마 5가지를 모두 사용할 수 있어요.
zh_hant: 預設玫瑰色。升級 Premium 解鎖全部 5 套配色。

source: 鼻塞
en: Nasal congestion
es: Congestión nasal
ja: 鼻づまり
ko: 코막힘

source: 评价 Maren
en: Rate Maren
es: Valorar Maren
ja: Marenを評価
ko: Maren 평가하기
zh_hant: 評價 Maren

source: 分享 Maren
en: Share Maren
es: Compartir Maren
ja: Marenをシェア
ko: Maren 공유하기

source: 我在用 Maren 记录经期和身体变化,数据只保存在手机里。
en: I use Maren to track my cycle and body changes. My data stays on my phone.
es: Uso Maren para registrar mi ciclo y los cambios de mi cuerpo. Mis datos se quedan en mi teléfono.
ja: Marenで生理周期や体の変化を記録しています。データはスマホの中だけに保存されます。
ko: 저는 Maren으로 주기와 몸의 변화를 기록해요. 제 데이터는 제 휴대폰에만 저장돼요.
zh_hant: 我在用 Maren 記錄經期和身體變化,資料只儲存在手機裡。

# Generated with Maren
source: 由 Maren 生成
en: Generated with Maren
es: Generado con Maren
ja: Maren で作成
ko: Maren으로 생성됨
zh_hant: 由 Maren 產生

source: %lld pending, will save when Maren is open
es: %lld pendientes, se guardarán al abrir Maren
ja: %lld件保留中、Marenを開くと保存されます
ko: %lld건 대기 중이며 Maren을 열면 저장돼요

source: %lld pending, will sync to iPhone
es: %lld pendientes, se sincronizarán con el iPhone
ja: %lld件保留中、iPhoneに同期されます
ko: %lld건 대기 중이며 iPhone과 동기화돼요

source: Apple Health
es: Salud de Apple
ko: Apple 건강

source: BBT %.1f°C
es: TBC %.1f°C
ko: 기초체온 %.1f°C

source: Daily reminder
es: Recordatorio diario
ja: 毎日のリマインダー
ko: 매일 알림

source: Note
es: Nota
ja: メモ
ko: 메모

source: Note (optional)
es: Nota (opcional)
ja: メモ(任意)
ko: 메모(선택)

source: Open Maren to view your reminder.
es: Abre Maren para ver tu recordatorio.
ja: Marenを開いてリマインダーを確認してください。
ko: Maren을 열어 알림을 확인하세요.

source: Optional details
es: Detalles opcionales
ja: 任意の詳細
ko: 세부 정보(선택)

source: Optional personal note, up to %lld characters
es: Nota personal opcional, hasta %lld caracteres
ja: 任意のメモ(最大%lld文字)
ko: 개인 메모(선택), 최대 %lld자

source: Reminder
es: Recordatorio
ja: リマインダー
ko: 알림

source: Reminder time
es: Hora del recordatorio
ja: リマインダーの時間
ko: 알림 시간

source: Save
es: Guardar
ja: 保存
ko: 저장

source: Save contraception record
es: Guardar registro de anticoncepción
ja: 避妊記録を保存
ko: 피임 기록 저장

source: Saves this local record and sends it to the parent callback
es: Guarda este registro local y lo envía a la función de retorno principal
ja: このローカル記録を保存し、親のコールバックに送信します
ko: 이 기기에 기록을 저장하고 상위 콜백으로 전달해요

source: Start date
es: Fecha de inicio
ja: 開始日
ko: 시작일

source: This preference is returned through the save callback for separate scheduling. No permission is requested here.
es: Esta preferencia se devuelve mediante la función de guardado para programarla aparte. Aquí no se pide ningún permiso.
ja: この設定は、別途スケジュールするために保存コールバックを通じて返されます。ここでは許可は求められません。
ko: 이 설정은 별도 예약을 위해 저장 콜백으로 전달돼요. 여기서는 권한을 요청하지 않아요.
